# GetClassOptions

## Description
Returns the class visibility setting for the active document.

```pascal
FUNCTION GetClassOptions : INTEGER;
```

```python
def vs.GetClassOptions():
    return INTEGER
```

## See Also
VS Functions:
SetClassOptions

## Version
Availability: from VectorWorks8.5

## Category
* Classes